---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.IndexLine
source: html/3b22e25e-f934-3931-6f22-e451ffcc11b0.htm
---
# Autodesk.Revit.DB.DirectContext3D.IndexLine

A line segment primitive consisting of two indices.

## Syntax (C#)
```csharp
public class IndexLine : IndexPrimitive
```